---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
CustomInitialColor Constructor
CustomInitialColor Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CustomInitialColor(Double) | Creates a custom initial color set to the given color |
|  | CustomInitialColor(CustomInitialColor) | Creates a copy of the given custom initial color |

# See Also

CustomInitialColor Class

CustomInitialColor Members

Autodesk.Revit.DB.Lighting Namespace